#include <stdio.h>

int main(void)
{
//     // 다차원 배열 Multimensional Array
//     int i; // ㅁ
    
//     int arr[5];
//     // ㅁㅁㅁㅁㅁ
//     // [0][1][2][3][4]
//     int arr2[2][5];
//     /*
//     ㅁㅁㅁㅁㅁ
//     ㅁㅁㅁㅁㅁ
//     arr2[0,0], arr2[0,1]...
//     arr2[1,0], arr2[1,1]...
//     */
//    int arr3[4][2];
//    /*
//    ㅁㅁ
//    ㅁㅁ
//    ㅁㅁ
//    ㅁㅁ
//    // arr3[0,0], arr3[0,1]
//    // arr3[1,0], arr3[1,1]
//    // arr3[2,0], arr3[2,1]
//    // arr3[3,0], arr3[3,1]
//    */
//     int arr4[3][3][3];
//     /*
//     ㅁㅁㅁ
//     ㅁㅁㅁ
//     ㅁㅁㅁ
//     */
    int arr[5] = {1,2,3,4,5};
    int arr2[2][5] = {{1,2,3,4,5},{1,2,3,4,5}};
    int arr3[4][2] = {{1,2},{1,2},{1,2},{1,2}};
    return 0;
}